OpenRTX/OpenRTX/platform/mcu/MK22FN512xxx12/drivers/usb/virtual_com.c
    switch (event)
    {
        case kUSB_DeviceEventBusReset:
        {
            USB_DeviceControlPipeInit(s_cdcVcom.deviceHandle);
            s_cdcVcom.attach = 0;
        }
        break;
        case kUSB_DeviceEventSetConfiguration:
            if (param)
            {
                s_cdcVcom.attach = 1;
                s_cdcVcom.currentConfiguration = *temp8;
                if (USB_CDC_VCOM_CONFIGURE_INDEX == (*temp8))
                {
                    usb_device_endpoint_init_struct_t epInitStruct;
                    usb_device_endpoint_callback_struct_t endpointCallback;

                    /* Initiailize endpoint for interrupt pipe */
                    endpointCallback.callbackFn = USB_DeviceCdcAcmInterruptIn;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_INTERRUPT;
                    epInitStruct.endpointAddress = USB_CDC_VCOM_INTERRUPT_IN_ENDPOINT |
                                                   (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    if (USB_SPEED_HIGH == s_cdcVcom.speed)
                    {
                        epInitStruct.maxPacketSize = HS_CDC_VCOM_INTERRUPT_IN_PACKET_SIZE;
                    }
                    else
                    {
                        epInitStruct.maxPacketSize = FS_CDC_VCOM_INTERRUPT_IN_PACKET_SIZE;
                    }

                    USB_DeviceInitEndpoint(s_cdcVcom.deviceHandle, &epInitStruct, &endpointCallback);

                    /* Initiailize endpoints for bulk pipe */
                    endpointCallback.callbackFn = USB_DeviceCdcAcmBulkIn;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_BULK;
                    epInitStruct.endpointAddress =
                        USB_CDC_VCOM_BULK_IN_ENDPOINT | (USB_IN << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    if (USB_SPEED_HIGH == s_cdcVcom.speed)
                    {
                        epInitStruct.maxPacketSize = HS_CDC_VCOM_BULK_IN_PACKET_SIZE;
                    }
                    else
                    {
                        epInitStruct.maxPacketSize = FS_CDC_VCOM_BULK_IN_PACKET_SIZE;
                    }

                    USB_DeviceInitEndpoint(s_cdcVcom.deviceHandle, &epInitStruct, &endpointCallback);

                    endpointCallback.callbackFn = USB_DeviceCdcAcmBulkOut;
                    endpointCallback.callbackParam = handle;

                    epInitStruct.zlt = 0;
                    epInitStruct.transferType = USB_ENDPOINT_BULK;
                    epInitStruct.endpointAddress =
                        USB_CDC_VCOM_BULK_OUT_ENDPOINT | (USB_OUT << USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT);
                    if (USB_SPEED_HIGH == s_cdcVcom.speed)
                    {
                        epInitStruct.maxPacketSize = HS_CDC_VCOM_BULK_OUT_PACKET_SIZE;
                    }
                    else
                    {
                        epInitStruct.maxPacketSize = FS_CDC_VCOM_BULK_OUT_PACKET_SIZE;
                    }

                    USB_DeviceInitEndpoint(s_cdcVcom.deviceHandle, &epInitStruct, &endpointCallback);

                    if (USB_SPEED_HIGH == s_cdcVcom.speed)
                    {
                        s_usbBulkMaxPacketSize = HS_CDC_VCOM_BULK_OUT_PACKET_SIZE;
                    }
                    else
                    {
                        s_usbBulkMaxPacketSize = FS_CDC_VCOM_BULK_OUT_PACKET_SIZE;
                    }
                    /* Schedule buffer for receive */
                    USB_DeviceRecvRequest(handle, USB_CDC_VCOM_BULK_OUT_ENDPOINT, s_currRecvBuf,
                                          s_usbBulkMaxPacketSize);
                }
            }
            break;
        default:
            break;
    }

    return error;
}

/*!
 * @brief USB configure endpoint function.
 *
 * This function configure endpoint status.
 *
 * @param handle The USB device handle.
 * @param ep Endpoint address.
 * @param status A flag to indicate whether to stall the endpoint. 1: stall, 0: unstall.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceConfigureEndpointStatus(usb_device_handle handle, uint8_t ep, uint8_t status)
{
    if (status)
    {
        return USB_DeviceStallEndpoint(handle, ep);
    }
    else
    {
        return USB_DeviceUnstallEndpoint(handle, ep);
    }
}

/*!
 * @brief USB Interrupt service routine.
 *
 * This function serves as the USB interrupt service routine.
 *
 * @return None.
 */
void USB0_IRQHandler(void)
{
    USB_DeviceKhciIsrFunction(s_cdcVcom.deviceHandle);
}


/******************************************************************************
 *                                                                            *
 *              Implementation of USB vcom functions                          *
 *                                                                            *
 ******************************************************************************/

void vcom_init()
{
    SIM->CLKDIV2 = SIM_CLKDIV2_USBDIV(0)
                 | SIM_CLKDIV2_USBFRAC(0);
    SIM->SOPT2 = SIM_SOPT2_USBSRC(1U)
               | SIM_SOPT2_PLLFLLSEL(3U);
    SIM->SCGC4 |= SIM_SCGC4_USBOTG(1);

    USB0->CLK_RECOVER_IRC_EN = 0x03U;
    USB0->CLK_RECOVER_CTRL |= USB_CLK_RECOVER_CTRL_CLOCK_RECOVER_EN_MASK;

    s_cdcVcom.speed = USB_SPEED_FULL;
    s_cdcVcom.attach = 0;
    s_cdcVcom.deviceHandle = NULL;

    if (USB_DeviceInit(kUSB_ControllerKhci0,USB_DeviceCallback,
                                &s_cdcVcom.deviceHandle) != kStatus_USB_Success)
    {
        return;
    }

    NVIC_SetPriority(USB0_IRQn, 3);
    NVIC_EnableIRQ(USB0_IRQn);

    USB_DeviceRun(s_cdcVcom.deviceHandle);
}

ssize_t vcom_writeBlock(const void *buf, size_t len)
{
    memcpy(s_currSendBuf, buf, len);
    if((s_cdcVcom.attach == 1) && (s_cdcVcom.startTransactions == 1))
    {
        (void) USB_DeviceSendRequest(s_cdcVcom.deviceHandle,
                                     USB_CDC_VCOM_BULK_IN_ENDPOINT,
                                     s_currSendBuf, len);
    }
}

ssize_t vcom_readBlock(void* buf, size_t len)
{
    if((s_cdcVcom.attach == 1) && (s_cdcVcom.startTransactions == 1))
    {
        size_t toTransfer = (len < s_recvSize) ? len : s_recvSize;
        memcpy(buf, s_currRecvBuf, toTransfer);
        s_recvSize = 0;
        return toTransfer;
    }

    return 0;
}

void APP_task(void)
{
//     usb_status_t error = kStatus_USB_Error;
//     if ((1 == s_cdcVcom.attach) && (1 == s_cdcVcom.startTransactions))
//     {
//         /* User Code */
//         if ((0 != s_recvSize) && (0xFFFFFFFFU != s_recvSize))
//         {
//             int32_t i;
// 
//             /* Copy Buffer to Send Buff */
//             for (i = 0; i < s_recvSize; i++)
//             {
//                 s_currSendBuf[s_sendSize++] = s_currRecvBuf[i];
//             }
//             s_recvSize = 0;
//         }
// 
//         if (s_sendSize)
//         {
//             uint32_t size = s_sendSize;
//             s_sendSize = 0;
// 
//             error = USB_DeviceSendRequest(s_cdcVcom.deviceHandle, USB_CDC_VCOM_BULK_IN_ENDPOINT, s_currSendBuf, size);
// 
//             if (error != kStatus_USB_Success)
//             {
//                 /* Failure to send Data Handling code here */
//             }
//         }
// 
//     }
}
